RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1171/drivers/fsl_enet.c
            /* Update left buffers as ready for next coming frame */
            do
            {
                /* The last buffer descriptor of a frame. */
                if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_RX_LAST_MASK))
                {
                    isLastBuff = true;
                }

                /* Clears status including the owner flag. */
                curBuffDescrip->control &= ENET_BUFFDESCRIPTOR_RX_WRAP_MASK;
                /* Sets the receive buffer descriptor with the empty flag. */
                curBuffDescrip->control |= ENET_BUFFDESCRIPTOR_RX_EMPTY_MASK;

                /* Increase current buffer descriptor to the next one. */
                rxBdRing->rxGenIdx = ENET_IncreaseIndex(rxBdRing->rxGenIdx, rxBdRing->rxRingLen);
                curBuffDescrip     = rxBdRing->rxBdBase + rxBdRing->rxGenIdx;
            } while (!isLastBuff);

            result = kStatus_ENET_RxFrameDrop;
            break;
        }
    } while (!isLastBuff);

    ENET_ActiveReadRing(base, ringId);

    return result;
}

#ifdef ENET_ENHANCEDBUFFERDESCRIPTOR_MODE
static inline void ENET_PrepareTxDesc(volatile enet_tx_bd_struct_t *txDesc, enet_tx_config_struct_t *txConfig)
{
    uint16_t controlExtend1 = 0U;

    /* For enable the timestamp. */
    if (txConfig->intEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_INTERRUPT_MASK;
    }
    if (txConfig->tsEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_TIMESTAMP_MASK;
    }
    if (txConfig->autoProtocolChecksum)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_PROTOCHECKSUM_MASK;
    }
    if (txConfig->autoIPChecksum)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_IPCHECKSUM_MASK;
    }
#if defined(FSL_FEATURE_ENET_HAS_AVB) && FSL_FEATURE_ENET_HAS_AVB
    if (txConfig->tltEnable)
    {
        controlExtend1 |= ENET_BUFFDESCRIPTOR_TX_USETXLAUNCHTIME_MASK;
        txDesc->txLaunchTimeLow |= txConfig->tltLow;
        txDesc->txLaunchTimeHigh |= txConfig->tltHigh;
    }
    controlExtend1 |= (uint16_t)ENET_BD_FTYPE(txConfig->AVBFrameType);
#endif /* FSL_FEATURE_ENET_HAS_AVB */

    txDesc->controlExtend1 = controlExtend1;
}
#endif /* ENET_ENHANCEDBUFFERDESCRIPTOR_MODE */

/*!
 * brief Sends one frame in specified BD ring with zero copy.
 *
 * This function supports scattered buffer transmit, user needs to provide the buffer array.
 * note Tx reclaim should be enabled to ensure the Tx buffer ownership can be given back to
 * application after Tx is over.
 *
 * param base   ENET peripheral base address.
 * param handle The ENET handler pointer. This is the same handler pointer used in the ENET_Init.
 * param txFrame The Tx frame structure.
 * param ringId The ring index or ring number.
 * retval kStatus_Success  Succeed to send one frame.
 * retval kStatus_ENET_TxFrameBusy  The BD is not ready for Tx or the reclaim operation still not finishs.
 * retval kStatus_ENET_TxFrameOverLen  The Tx frame length is over max ethernet frame length.
 */
status_t ENET_StartTxFrame(ENET_Type *base, enet_handle_t *handle, enet_tx_frame_struct_t *txFrame, uint8_t ringId)
{
    assert(handle != NULL);
    assert(ringId < (uint8_t)FSL_FEATURE_ENET_QUEUE);
    assert(txFrame->txBuffArray != NULL);
    assert(txFrame->txBuffNum != 0U);
    assert(handle->txReclaimEnable[ringId]);

    volatile enet_tx_bd_struct_t *curBuffDescrip;
    enet_tx_bd_ring_t *txBdRing       = &handle->txBdRing[ringId];
    enet_tx_dirty_ring_t *txDirtyRing = &handle->txDirtyRing[ringId];
    status_t result                   = kStatus_Success;
    enet_buffer_struct_t *txBuff      = txFrame->txBuffArray;
    uint32_t txBuffNum                = txFrame->txBuffNum;
    enet_frame_info_t *txDirty        = NULL;
    uint32_t frameLen                 = 0;
    uint32_t idleDescNum              = 0;
    uint16_t index                    = 0;
    uint32_t configVal;
    uint32_t primask;
    uintptr_t buffer;

    /* Calculate frame length and Tx data buffer number. */
    do
    {
        frameLen += txBuff->length;
        txBuff++;
    } while (--txBuffNum != 0U);
    txBuffNum = txFrame->txBuffNum;

    /* Check whether the available BD number is enough for Tx data buffer. */
    curBuffDescrip = txBdRing->txBdBase + txBdRing->txGenIdx;
    index          = txBdRing->txGenIdx;
    do
    {
        if (0U != (curBuffDescrip->control & ENET_BUFFDESCRIPTOR_TX_READY_MASK))
        {
            break;
        }

        /* Idle BD number is enough */
        if (++idleDescNum >= txBuffNum)
        {
            break;
        }
        index          = ENET_IncreaseIndex(index, txBdRing->txRingLen);
        curBuffDescrip = txBdRing->txBdBase + index;
    } while (index != txBdRing->txGenIdx);

    /* Check the frame length. */
    if (frameLen > ENET_FRAME_TX_LEN_LIMITATION(base))
    {
        result = kStatus_ENET_TxFrameOverLen;
    }
    /* Return busy if idle BD is not enough. */
    else if (txBuffNum > idleDescNum)
    {
        result = kStatus_ENET_TxFrameBusy;
    }
    /* Check txDirtyRing if need frameinfo in tx interrupt callback. */
    else if (!ENET_TxDirtyRingAvailable(txDirtyRing))
    {
        result = kStatus_ENET_TxFrameBusy;
    }
    else
    {
        txBuff = txFrame->txBuffArray;
        do
        {
            assert(txBuff->buffer != NULL);
            assert((uint64_t)(uintptr_t)(uint8_t *)txBuff->buffer + txBuff->length - 1U <= UINT32_MAX);

#if defined(FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL) && FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL
            if (handle->txMaintainEnable[ringId])
            {
                DCACHE_CleanByRange((uintptr_t)(uint8_t *)txBuff->buffer, txBuff->length);
            }
#endif /* FSL_SDK_ENABLE_DRIVER_CACHE_CONTROL */
#if defined(FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET) && FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET
            /* Map loacl memory address to DMA for special platform. */
            buffer = MEMORY_ConvertMemoryMapAddress((uintptr_t)(uint8_t *)txBuff->buffer, kMEMORY_Local2DMA);
#else
            buffer = (uintptr_t)(uint8_t *)txBuff->buffer;
#endif /* FSL_FEATURE_MEMORY_HAS_ADDRESS_OFFSET */

            /* Set data buffer and length. */
            curBuffDescrip         = txBdRing->txBdBase + txBdRing->txGenIdx;
            curBuffDescrip->buffer = (uint32_t)buffer;
            curBuffDescrip->length = txBuff->length;

